{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_1",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 2,
            "activation": "softmax",
            "use_bias": true
          }
        }
      ]
    },
    "keras_version": "2.2.4",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [3, 3, 3, 64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [97672, 2],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [2],
          "dtype": "float32"
        }
      ]
    }
  ],
  "format": "layers-model",
  "generatedBy": "keras v2.2.4",
  "convertedBy": "TensorFlow.js Converter v1.0.0"
}
